rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FLASH.h
/*! @name UD2 - UTest Data 2 */
/*! @{ */

#define FLASH_UD2_EDATAC_MASK                    (0xFFU)
#define FLASH_UD2_EDATAC_SHIFT                   (0U)
#define FLASH_UD2_EDATAC_WIDTH                   (8U)
#define FLASH_UD2_EDATAC(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_EDATAC_SHIFT)) & FLASH_UD2_EDATAC_MASK)

#define FLASH_UD2_ED0_MASK                       (0x1000000U)
#define FLASH_UD2_ED0_SHIFT                      (24U)
#define FLASH_UD2_ED0_WIDTH                      (1U)
#define FLASH_UD2_ED0(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_ED0_SHIFT)) & FLASH_UD2_ED0_MASK)

#define FLASH_UD2_ED1_MASK                       (0x2000000U)
#define FLASH_UD2_ED1_SHIFT                      (25U)
#define FLASH_UD2_ED1_WIDTH                      (1U)
#define FLASH_UD2_ED1(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_ED1_SHIFT)) & FLASH_UD2_ED1_MASK)

#define FLASH_UD2_ED2_MASK                       (0x4000000U)
#define FLASH_UD2_ED2_SHIFT                      (26U)
#define FLASH_UD2_ED2_WIDTH                      (1U)
#define FLASH_UD2_ED2(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_ED2_SHIFT)) & FLASH_UD2_ED2_MASK)

#define FLASH_UD2_ED3_MASK                       (0x8000000U)
#define FLASH_UD2_ED3_SHIFT                      (27U)
#define FLASH_UD2_ED3_WIDTH                      (1U)
#define FLASH_UD2_ED3(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_ED3_SHIFT)) & FLASH_UD2_ED3_MASK)
/*! @} */

/*! @name UD3 - UTest Data 3 */
/*! @{ */

#define FLASH_UD3_EDDATA_MASK                    (0xFFFFFFFFU)
#define FLASH_UD3_EDDATA_SHIFT                   (0U)
#define FLASH_UD3_EDDATA_WIDTH                   (32U)
#define FLASH_UD3_EDDATA(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_UD3_EDDATA_SHIFT)) & FLASH_UD3_EDDATA_MASK)
/*! @} */

/*! @name UD4 - UTest Data 4 */
/*! @{ */

#define FLASH_UD4_EDDATA_MASK                    (0xFFFFFFFFU)
#define FLASH_UD4_EDDATA_SHIFT                   (0U)
#define FLASH_UD4_EDDATA_WIDTH                   (32U)
#define FLASH_UD4_EDDATA(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_UD4_EDDATA_SHIFT)) & FLASH_UD4_EDDATA_MASK)
/*! @} */

/*! @name UD5 - UTest Data 5 */
/*! @{ */

#define FLASH_UD5_EDDATAC_MASK                   (0xFFU)
#define FLASH_UD5_EDDATAC_SHIFT                  (0U)
#define FLASH_UD5_EDDATAC_WIDTH                  (8U)
#define FLASH_UD5_EDDATAC(x)                     (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDDATAC_SHIFT)) & FLASH_UD5_EDDATAC_MASK)

#define FLASH_UD5_EDD0_MASK                      (0x1000000U)
#define FLASH_UD5_EDD0_SHIFT                     (24U)
#define FLASH_UD5_EDD0_WIDTH                     (1U)
#define FLASH_UD5_EDD0(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD0_SHIFT)) & FLASH_UD5_EDD0_MASK)

#define FLASH_UD5_EDD1_MASK                      (0x2000000U)
#define FLASH_UD5_EDD1_SHIFT                     (25U)
#define FLASH_UD5_EDD1_WIDTH                     (1U)
#define FLASH_UD5_EDD1(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD1_SHIFT)) & FLASH_UD5_EDD1_MASK)

#define FLASH_UD5_EDD2_MASK                      (0x4000000U)
#define FLASH_UD5_EDD2_SHIFT                     (26U)
#define FLASH_UD5_EDD2_WIDTH                     (1U)
#define FLASH_UD5_EDD2(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD2_SHIFT)) & FLASH_UD5_EDD2_MASK)

#define FLASH_UD5_EDD3_MASK                      (0x8000000U)
#define FLASH_UD5_EDD3_SHIFT                     (27U)
#define FLASH_UD5_EDD3_WIDTH                     (1U)
#define FLASH_UD5_EDD3(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD3_SHIFT)) & FLASH_UD5_EDD3_MASK)
/*! @} */

/*! @name UA0 - UTest Address 0 */
/*! @{ */

#define FLASH_UA0_AEI_MASK                       (0xFFFFFFFFU)
#define FLASH_UA0_AEI_SHIFT                      (0U)
#define FLASH_UA0_AEI_WIDTH                      (32U)
#define FLASH_UA0_AEI(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UA0_AEI_SHIFT)) & FLASH_UA0_AEI_MASK)
/*! @} */

/*! @name UA1 - UTest Address 1 */
/*! @{ */

#define FLASH_UA1_AEI_MASK                       (0xFFFFFU)
#define FLASH_UA1_AEI_SHIFT                      (0U)
#define FLASH_UA1_AEI_WIDTH                      (20U)
#define FLASH_UA1_AEI(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UA1_AEI_SHIFT)) & FLASH_UA1_AEI_MASK)
/*! @} */

/*! @name XMCR - Express Module Configuration */
/*! @{ */

#define FLASH_XMCR_XEHV_MASK                     (0x1U)
#define FLASH_XMCR_XEHV_SHIFT                    (0U)
#define FLASH_XMCR_XEHV_WIDTH                    (1U)
#define FLASH_XMCR_XEHV(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XEHV_SHIFT)) & FLASH_XMCR_XEHV_MASK)

#define FLASH_XMCR_XPGM_MASK                     (0x100U)
#define FLASH_XMCR_XPGM_SHIFT                    (8U)
#define FLASH_XMCR_XPGM_WIDTH                    (1U)
#define FLASH_XMCR_XPGM(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XPGM_SHIFT)) & FLASH_XMCR_XPGM_MASK)

#define FLASH_XMCR_XEPEG_MASK                    (0x200U)
#define FLASH_XMCR_XEPEG_SHIFT                   (9U)
#define FLASH_XMCR_XEPEG_WIDTH                   (1U)
#define FLASH_XMCR_XEPEG(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XEPEG_SHIFT)) & FLASH_XMCR_XEPEG_MASK)

#define FLASH_XMCR_XWDIE_MASK                    (0x800U)
#define FLASH_XMCR_XWDIE_SHIFT                   (11U)
#define FLASH_XMCR_XWDIE_WIDTH                   (1U)
#define FLASH_XMCR_XWDIE(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XWDIE_SHIFT)) & FLASH_XMCR_XWDIE_MASK)

#define FLASH_XMCR_XWDI_MASK                     (0x1000U)
#define FLASH_XMCR_XWDI_SHIFT                    (12U)
#define FLASH_XMCR_XWDI_WIDTH                    (1U)
#define FLASH_XMCR_XWDI(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XWDI_SHIFT)) & FLASH_XMCR_XWDI_MASK)

